from functools import partial


class _Joyo(frozenset):
    HEISEI22 = frozenset(
        "矢王穀胃長班典将考栄畑単輸福役修障捨行固格面権参草臓練額専労純吸貿台的居導火塩係要宮階対服並積源神炭待妻批波里応今無得舎部実着観署翌識就北鼻置県仏城領熟仕苦税仮成婦羽投飼委上供落気白持窓頂盛指政茶族意職病阪円評刊訓薬芽告客低証章原石史故力都州兆賛町弁段移飲業働関性若版協帳奏記作湖機辞効険比縦模存勤題梅銭東集地箱静毛康逆志晴馬列側説二縄編育数覧紅改穴旅善農宗種節具代橋売急先潟頭序井複風覚型氷港臨欲回童希絹尺票特物熱操密声順録築派泣臣速阜相庫老禁砂郷冷預糸優当決鳥向授裁様究営痛終腸警案場誕処絵食聖追登染確測生商別包検裏張願七去利画負容身綿児反蒸花線美司現夏拡景歴寸温構発管計岐料冊四古何求済象常刻竹統才安徳根雨囲銀員慣野益蔵装会習松始真前知九局差復校残皇写秋支精賃旗賞防垂万針午達十付非秘央出崎岡降再訪用答忘郵陽最仁油副手明欠広例夕罪造往后動泉岩者田兄未接科収滋難目片価祭総浴定池経岸書奈貧細印各黄秒敵境工軽木柱佐不太研盟内補少械詞強刀制類乳困推救走英同規師世果全雪完簡庁肥語昔沖流旧死鏡戦乱好帰億引樹在度宙鉱庭験訳絶便割誠断学公句机拾護縮冬探孫灯蚕均正八則忠程脳信養赤灰話百器余耳功毒折傷鹿駅賀勝律両誌毎足下私朝棒子半重己船背魚算道漁千麦納幸談資陸採館令読隊技牛勇独官潔栃混週留径亡青芸厚条谷害金増伝国教文川男後高笑底夫閉暖父布門合件失射埼植春路報像問満区異取悲海式宝展小敬健遺買誤招天粉墓五否努六貨界革紀株視周卵角因貸皮茨元放準仲礼財謝分量術停店圧心湯親位西質休際遠良弟妹初顔末歌紙党悪許媛愛略浅巣義担候策肉葉快巻唱照層医興責犬坂緑揮園平宣南曲以衣借災殺暴任夜治沿域人昭山泳課喜情深奮退争横息短想名番羊月述共認打熊倉素値恩諸戸受危能結変迷主止夢脈俳券三京女閣胸届状豆宅骨左品織開看理外期富席幹寺競街守組感判兵然宇費整球早和姉思一電菜干厳社減多博言群返曜刷府銅枚空設犯武入切黒通年友永時貴星団飛省札調等所眼著寄貯聞申給氏丁査弱運丸住焼念姿車試論属枝洗延勉士率祖活送虫中皿河消玉板耕新近血酒表俵筆拝提音使形次創漢材有肺軍潮鉄昼色昨酸汽舌筋暮幕演事散加呼水字衆選鋼立見討映磁績久憲極詩産帯乗村必間寒第燃遊郡右光直起続基倍講君破製勢来座級土朗察暑衛首笛建望卒林飯疑可洋牧保陛損点配森弓由号約連味方腹香母荷解化徒液辺鳴交束他楽清系転暗島態雲豊日助祝従口似至示劇標除注貝孝尊図命歯備糖航易挙我桜過晩承法輪堂幼激個自雑敗限宿家室民適大歩院屋体季務議進本予米梨市握扱依威偉為違緯維壱芋隠陰鋭影越援縁煙鉛汚押奥憶菓箇暇雅介壊戒皆較獲刈甘監汗歓勧乾鑑環含奇鬼祈輝幾儀戯詰脚却丘及朽拠巨距御驚凶恐響叫狭狂況仰駆屈掘繰傾恵迎撃肩堅遣兼軒圏剣玄誇鼓枯継互更荒抗攻稿香恒項豪込婚鎖歳彩載剤咲惨雌伺紫刺脂旨執芝煮斜釈寂狩朱趣需秀舟襲柔獣瞬巡旬盾紹召沼詳床称畳丈飾殖触浸震慎侵寝振薪陣尽尋吹是征姓井跡扇占鮮訴燥騒僧贈即俗耐替拓沢濁脱丹端嘆淡弾恥遅致蓄沖跳徴澄珍沈抵堤摘滴添殿途吐渡奴怒透唐桃盗塔到倒逃踏稲闘胴峠突鈍曇弐悩濃輩杯泊拍迫薄爆髪抜罰繁販搬範般盤被疲彼避尾微匹描浜敏怖膚浮腐敷普賦舞幅払噴柄壁捕舗峰抱砲肪坊忙冒傍帽凡盆漫慢妙眠矛霧娘茂網猛黙紋踊雄与誉腰溶躍謡翼雷頼絡欄離粒慮療隣涙隷麗齢暦劣烈恋露郎惑腕哀慰詠悦閲炎宴欧殴乙卸穏架佳華嫁餓怪悔塊概慨該穫隔郭岳掛滑勘肝貫敢緩冠換喚企軌棄棋忌既岐騎犠欺菊吉喫虐虚脅峡凝緊斤愚偶遇啓鶏携掲刑憩契鯨賢倹幻雇顧弧孤悟娯甲孔控拘郊硬綱巧坑慌絞酵克獄魂紺恨墾催債削錯搾撮擦暫施祉諮侍慈軸湿疾赦邪殊寿潤遵徐如晶掌鐘焦衝昇匠譲錠嬢冗嘱辱審伸辛粋炊遂衰穂酔随髄瀬牲婿請隻惜斥籍摂潜繕措阻粗礎双桑葬掃遭憎促賊逮胎怠滞袋滝託卓択諾奪胆鍛壇稚畜窒駐抽鋳彫超聴陳鎮墜訂帝締哲斗塗陶凍痘匿篤豚尿粘婆排陪縛伐帆伴藩畔蛮泌卑碑姫漂苗赴符封伏覆墳紛癖募慕簿崩芳胞縫倣邦飽奉妨乏謀膨房某墨没翻魔埋膜又魅滅免幽憂誘擁揚揺抑裸濫吏隆了猟陵糧厘零霊励裂錬廉炉漏廊浪楼湾亜尉逸韻姻疫謁猿凹翁虞稼寡禍渦靴蚊拐懐涯劾垣核殻嚇潟喝渇褐轄括且患缶棺陥堪款還艦閑寛憾頑飢偽擬宜糾窮拒挟享矯恭暁菌謹琴襟吟隅薫勲蛍茎渓慶傑嫌謙献顕懸繭弦呉碁購肯洪江貢衡侯溝剛拷酷昆懇佐詐唆栽砕宰斎崎酢索桟傘賜嗣肢滋璽漆遮蛇酌爵珠儒臭囚醜酬愁銃渋充汁粛淑叔塾俊准循殉庶緒叙渉祥升硝尚肖償抄奨彰症宵粧礁訟詔剰浄壌醸縄娠津紳診唇刃迅甚睡帥枢崇据杉畝斉誓逝析窃拙栓薦仙繊践旋遷禅漸疎租塑捜壮荘藻喪霜挿槽曹駄妥堕惰泰濯但棚痴逐秩嫡衷挑眺弔懲釣勅朕塚漬坪邸亭艇呈廷偵貞逓泥徹撤迭搭筒悼棟騰謄洞督凸屯軟尼忍妊寧把覇廃培賠媒伯舶漠肌鉢閥煩頒披扉妃罷猫頻賓瓶譜扶附侮沸雰憤幣弊塀併丙偏遍浦褒泡俸剖紡僕撲朴堀奔摩磨麻抹岬銘盲耗妄厄癒諭愉唯悠裕融猶窯庸羅酪履痢柳竜硫虜寮僚涼倫累塁鈴戻賄枠挨曖宛嵐畏萎椅彙茨咽淫唄鬱怨媛艶旺岡臆俺苛牙瓦楷潰諧崖蓋骸柿顎葛釜鎌韓玩伎亀毀畿臼嗅巾僅錦惧串窟熊詣憬稽隙桁拳鍵舷股虎錮勾梗喉乞傲駒頃痕沙挫采塞埼柵刹拶斬恣摯餌鹿叱嫉腫呪袖羞蹴憧拭尻芯腎須裾凄醒脊戚煎羨腺詮箋膳狙遡曽爽痩踪捉遜汰唾堆戴誰旦綻緻酎貼嘲捗椎爪鶴諦溺塡妬賭藤瞳栃頓貪丼那奈梨謎鍋匂虹捻罵剝箸氾汎阪斑眉膝肘阜訃蔽餅璧蔑哺蜂貌頬睦勃昧枕蜜冥麺冶弥闇喩湧妖瘍沃拉辣藍璃慄侶瞭瑠呂賂弄籠麓脇"
    )
    SHOWA56 = frozenset(
        "判票領偽秀息礼閑霜七僚材拘覧大覚声楽渉巻促枢就派暇廷篤剛幼挙等慨電脅実徳程繁弁襲抹不果潔了泳六星残釈狂撃得寄壱型彼競懲焦苦別娠秒騰号粗陽訓字悪柄仕分沼詐飲巡婦俗告盟識設偉汚類独崩牛為間予批紫看絹糖飢願寺体慌離澄絵勤寂准岐有失傷稿伺験剰盲洗端悩郎蚊父伴刻馬糧夏塩情硫画天衆稚気各雨圏揮搾液滋都咲故漁委義研似草患珠含迭欠万尽報熟混事犯暫志錘産指微減積青泡日壊丈遵権醸念燥疫貴尋匠本岬参胴欧雄震痛国鎮近酸閲挟航宵違踊預臓衰濯舎睡酪履働湾朴棚末悼涼茂黙恋地抜簿棟劇前貯戻化茶遮未妻久険母析会潮紅覆担舌旧士種汁戸板蛮桟択風桑媒砕糾陥値悟朗余図覇林尼博目鎖笛釣次頂宗隊消支殴累純福譜折嫌濁猛面衷頒静筋破峠郭角賠免理刑九給束炊沈思膨適愁臭納豪平桜筒内欲峰惨婆兆商昇改瞬副全伯隣取浮又腐救庭塁聴浸上矢洋滅切瓶紺褐栽決敏整響凍今放疾及凹悠柱濃柳誕厚淡把奉物男潜尿防乳株忙広抄郊偏亭数視肖吹松社慮靴提臣殿動眺鐘煙頻発短譲保穀長堕盗四膜宣除仙如速包遊幾欺開彩畑捜霊波版壮敢個像蛍行垂牲克栄複抱己降僕承憂刊丙怠禍飯過諾特偵虐眠倉考秩狩璽結院齢美惰阻佐儒幸尾械勅弔来売県人布井刷斜雅益駆令群逓菓貢友導乏少賊格常以円退拒極飽要隠黒建植漂革甘揚怪孫隷優収符応是騎際虚絞炉里達戦倒頼期低漠侍医中鍛蓄丁計船勢墓穂胃診妙猟方扇雷顧虫金惑謝州殖典呉財著突賦崎暴脱絡客約恩暖肉望謄検繕割姓砂憤冗麻詩漏竹帯喜践升幹鉱一卸剤燃擦旬君冊装灰渇紛牧木栓隆絶軽奴距相逆彫横侮懸呼規健銃宿正肪鳴系傍乱宰畜髪労池夜還陳庸協妹援疑練賃境抗枠難芸創房振業鮮費鏡渓据丸税斗当堤黄深森施階主鈴私銀吟顔娘閥庁香算薄市郵侯充雲漢箇測曲古奪江愉巨泥舞醜固雰言踏項供匹酷喝致身認魂裂凝屈川惜英厄位倫他均農並休史使憾斎滞拓潤忠辞銅級泰辺唆術拐吐蔵兵妊祈知経衝恐水緯斥法附般春圧銘道隅多盤廃嘱教扉坂坊追満高拙選立記霧捕甚薦互議証貸届賞仏梅製第揺販康酢刃績徐循接凸必城侵炭迷輸案魚補某往漬没賢血晶枝挑麦拝措箱棒早米樹顕洪悔貨曇撮寝祉億謡享怒藻走公門徒窯急泊膚辛浅状食押順増匁恭張容合詔泣去卵禁穴握石浦需昨誉昼守神置五出陸冷憩書粒聞猿雇送可差性館詞妄搬謀畔心枚珍勇叙京盛住舗足薪解渋便胸形衛攻準刈管跡寡被託示軌策枯淑懇登月祥遂薬講剖隔備繭障秋腹皿歌慢命涙芳名耕象岸逃舟幅喪交崇越週若調華良綿仁涯掘坪亜仰帆披団養培光慶紙暮紹係蛇賀進態羽域洞暑閉素量件孤列用護育才討腕御迅断反逐称葉帳花憎遷砲弦塑基南摘訂獣毛歩徹底籍帝拾腰酌影塚触究氷推溝溶統訳玄濫探密裕者留倹奇遅孔利窓寮寒鑑環由氏旅豚界騒封緩倣礁壁輝二季点否塗赦造制課娯縮賄器皆成謹染見質卓児延錯辱清番稲苗弓魅后沿畳邸投湯式津迫官百夢吏替到時灯僧郷傑線悦引治缶祭胆印停冒艇机奥渡豆座戯操剣朝節宝陰焼湿錬初征疎猶盾機仮腸桃謁映感毎尚貝窒描演欄伸例太獲喚尊求巧弾携庶軟敷勺誤能赴凶執陣殺貫糸噴察軸屋元署片翼属愛稼酒痘傾諸十卑存荘緒恥北句希職肺威弐死掛胎胞朽関脳飾愚路疲功軒挿八塔千慣歴府務賛暗班誇貿輪配確世穫諮爆核共徴駄掲老啓対豊購叔撤変吸掃緊文褒帰助談宴罷勲縛乾済菜依趣肯鉛飼穏寧縦魔跳暁茎鳥畝壇展訟旗再力礎陵町督債自陶呈但品模姫劾諭肌採好則区孝症序場許空話連脹何定鉄妨口精我所伝冬誌企菊浄囚処懐狭干粧和擁却作俊捨殉炎頭且径乙宅垣彰率聖海鈍煩臨邪双監慰任工舶表柔民祝婿嫁半球在景曜瀬段夫甲童雑恵価従汗叫加犬居堂政室粘占槽湖橋沖帽餓科射即勉宜党烈審卒最扱車宇恨袋災札拷窮夕集傘鋭細様秘善薫始想翁脚略犠堅兼弟勘続寿酔持罰矛荒亡罪永銑困偶筆晩丘照厘囲原冠忍融唐買堪契坑専温題途透網券尺幽髄妃勝強止楼銭刺省韻借田哲陪運曹意帥軍租範招店戒貧邦修回癒羅巣易爵斉限壌嬢料怖丹憶述王刀慕暦散抵無宙渦滝至遍席条笑紀拍吉針昆完排録与央墨具赤岩西遺款奮詠評左歳年訴概贈献唇沸校異寛紡真衣詳払授背峡毒翻眼載拡姿重嘆明荷伐倍墳山雪嚇屯皮司注嗣逝幻既敬締飛迎棄同廊鬼親鯨芝両召味併驚療右慈架負索婚流庫貞痢沢煮菌賜匿観肢将掌試請復姻盆繰藩忌損蚕杉憲翌唱織誘入紋緑佳恒家読島錠募控代綱露耗縫肝営員凡玉終肩遣碑色通誓羊酬伏晴安頑浴輩汽雌移鉢構耳河査候摂励先非厳武介小芋技根普源兄骨脈首三硬油朕摩維更標裁効墜勧白病竜打火鼻野皇谷賓潟虞泉村向後快猫慎的扶築哀抽富習衡誠責劣妥港歯謙逸奏付撲襟信音喫痴唯縁詰嫡宮弱姉写窃危添逮警艦廉生簡服族土磁墾昔儀章滴弊午論熱浪殊裏鶏床遭敵律額抑琴獄台酵落継紳硝零外返敗度禅繊鋳塾旋堀問避奨手弧駐新比待耐側粋脂遠周随括資層況申粛催虜乗答着斤園芽裸下擬単込起葬寸編鼓岳説朱鋼幣興転棺縄悲女杯棋肥俸俳子因幕祖塀努総磨搭忘隻殻語現麗超漫駅該旨換矯局拠師役俵陛塊漆歓尉蒸削閣闘浜受然躍争埋部直害轄訪学組較東粉滑活償泌街碁奔癖遇激郡昭漸仲"
    )

    def __new__(cls):
        return super().__new__(cls, cls.HEISEI22)

    @classmethod
    def version_list(cls):
        return [
            name for name, value in cls.__dict__.items() if isinstance(value, frozenset)
        ]


class _KyoikuVersion(frozenset):
    def __new__(cls, version):
        instance = super().__new__(
            cls, [kanji for grade in version.values() for kanji in grade]
        )
        instance._version = version
        return instance

    def grade(self, g: int) -> frozenset:
        return self._version[g]

    GRADE1 = property(partial(grade, g=1))
    GRADE2 = property(partial(grade, g=2))
    GRADE3 = property(partial(grade, g=3))
    GRADE4 = property(partial(grade, g=4))
    GRADE5 = property(partial(grade, g=5))
    GRADE6 = property(partial(grade, g=6))


class _Kyoiku(frozenset):
    REIWA2 = _KyoikuVersion(
        {
            # source: http://www.mext.go.jp/component/a_menu/education/micro_detail/__icsFiles/afieldfile/2017/05/12/1384661_4_2.pdf
            1: frozenset(
                "一右雨円王音下火花貝学気九休玉金空月犬見五口校左三山子四糸字耳七車手十出女小上森人水正生青夕石赤千川先早草足村大男竹中虫町天田土二日入年白八百文木本名目立力林六"
            ),
            2: frozenset(
                "引羽雲園遠何科夏家歌画回会海絵外角楽活間丸岩顔汽記帰弓牛魚京強教近兄形計元言原戸古午後語工公広交光考行高黄合谷国黒今才細作算止市矢姉思紙寺自時室社弱首秋週春書少場色食心新親図数西声星晴切雪船線前組走多太体台地池知茶昼長鳥朝直通弟店点電刀冬当東答頭同道読内南肉馬売買麦半番父風分聞米歩母方北毎妹万明鳴毛門夜野友用曜来里理話"
            ),
            3: frozenset(
                "悪安暗医委意育員院飲運泳駅央横屋温化荷界開階寒感漢館岸起期客究急級宮球去橋業曲局銀区苦具君係軽血決研県庫湖向幸港号根祭皿仕死使始指歯詩次事持式実写者主守取酒受州拾終習集住重宿所暑助昭消商章勝乗植申身神真深進世整昔全相送想息速族他打対待代第題炭短談着注柱丁帳調追定庭笛鉄転都度投豆島湯登等動童農波配倍箱畑発反坂板皮悲美鼻筆氷表秒病品負部服福物平返勉放味命面問役薬由油有遊予羊洋葉陽様落流旅両緑礼列練路和"
            ),
            4: frozenset(
                "愛案以衣位茨印英栄媛塩岡億加果貨課芽賀改械害街各覚潟完官管関観願岐希季旗器機議求泣給挙漁共協鏡競極熊訓軍郡群径景芸欠結建健験固功好香候康佐差菜最埼材崎昨札刷察参産散残氏司試児治滋辞鹿失借種周祝順初松笑唱焼照城縄臣信井成省清静席積折節説浅戦選然争倉巣束側続卒孫帯隊達単置仲沖兆低底的典伝徒努灯働特徳栃奈梨熱念敗梅博阪飯飛必票標不夫付府阜富副兵別辺変便包法望牧末満未民無約勇要養浴利陸良料量輪類令冷例連老労録"
            ),
            5: frozenset(
                "圧囲移因永営衛易益液演応往桜可仮価河過快解格確額刊幹慣眼紀基寄規喜技義逆久旧救居許境均禁句型経潔件険検限現減故個護効厚耕航鉱構興講告混査再災妻採際在財罪殺雑酸賛士支史志枝師資飼示似識質舎謝授修述術準序招証象賞条状常情織職制性政勢精製税責績接設絶祖素総造像増則測属率損貸態団断築貯張停提程適統堂銅導得毒独任燃能破犯判版比肥非費備評貧布婦武復複仏粉編弁保墓報豊防貿暴脈務夢迷綿輸余容略留領歴"
            ),
            6: frozenset(
                "胃異遺域宇映延沿恩我灰拡革閣割株干巻看簡危机揮貴疑吸供胸郷勤筋系敬警劇激穴券絹権憲源厳己呼誤后孝皇紅降鋼刻穀骨困砂座済裁策冊蚕至私姿視詞誌磁射捨尺若樹収宗就衆従縦縮熟純処署諸除承将傷障蒸針仁垂推寸盛聖誠舌宣専泉洗染銭善奏窓創装層操蔵臓存尊退宅担探誕段暖値宙忠著庁頂腸潮賃痛敵展討党糖届難乳認納脳派拝背肺俳班晩否批秘俵腹奮並陛閉片補暮宝訪亡忘棒枚幕密盟模訳郵優預幼欲翌乱卵覧裏律臨朗論"
            ),
        }
    )
    HEISEI4 = _KyoikuVersion(
        {
            # source: https://www.mext.go.jp/a_menu/shotou/new-cs/youryou/syo/koku/001.htm
            1: frozenset(
                "一右雨円王音下火花貝学気九休玉金空月犬見五口校左三山子四糸字耳七車手十出女小上森人水正生青夕石赤千川先早草足村大男竹中虫町天田土二日入年白八百文木本名目立力林六"
            ),
            2: frozenset(
                "引羽雲園遠何科夏家歌画回会海絵外角楽活間丸岩顔汽記帰弓牛魚京強教近兄形計元言原戸古午後語工公広交光考行高黄合谷国黒今才細作算止市矢姉思紙寺自時室社弱首秋週春書少場色食心新親図数西声星晴切雪船線前組走多太体台地池知茶昼長鳥朝直通弟店点電刀冬当東答頭同道読内南肉馬売買麦半番父風分聞米歩母方北毎妹万明鳴毛門夜野友用曜来里理話"
            ),
            3: frozenset(
                "悪安暗医委意育員院飲運泳駅央横屋温化荷界開階寒感漢館岸起期客究急級宮球去橋業曲局銀区苦具君係軽血決研県庫湖向幸港号根祭皿仕死使始指歯詩次事持式実写者主守取酒受州拾終習集住重宿所暑助昭消商章勝乗植申身神真深進世整昔全相送想息速族他打対待代第題炭短談着注柱丁帳調追定庭笛鉄転都度投豆島湯登等動童農波配倍箱畑発反坂板皮悲美鼻筆氷表秒病品負部服福物平返勉放味命面問役薬由油有遊予羊洋葉陽様落流旅両緑礼列練路和"
            ),
            4: frozenset(
                "愛案以衣位囲胃印英栄塩億加果貨課芽改械害街各覚完官管関観願希季紀喜旗器機議求泣救給挙漁共協鏡競極訓軍郡径型景芸欠結建健験固功好候航康告差菜最材昨札刷殺察参産散残士氏史司試児治辞失借種周祝順初松笑唱焼象照賞臣信成省清静席積折節説浅戦選然争倉巣束側続卒孫帯隊達単置仲貯兆腸低底停的典伝徒努灯堂働特得毒熱念敗梅博飯飛費必票標不夫付府副粉兵別辺変便包法望牧末満未脈民無約勇要養浴利陸良料量輪類令冷例歴連老労録"
            ),
            5: frozenset(
                "圧移因永営衛易益液演応往桜恩可仮価河過賀快解格確額刊幹慣眼基寄規技義逆久旧居許境均禁句群経潔件券険検限現減故個護効厚耕鉱構興講混査再災妻採際在財罪雑酸賛支志枝師資飼示似識質舎謝授修述術準序招承証条状常情織職制性政勢精製税責績接設舌絶銭祖素総造像増則測属率損退貸態団断築張提程適敵統銅導徳独任燃能破犯判版比肥非備俵評貧布婦富武復複仏編弁保墓報豊防貿暴務夢迷綿輸余預容略留領"
            ),
            6: frozenset(
                "異遺域宇映延沿我灰拡革閣割株干巻看簡危机揮貴疑吸供胸郷勤筋系敬警劇激穴絹権憲源厳己呼誤后孝皇紅降鋼刻穀骨困砂座済裁策冊蚕至私姿視詞誌磁射捨尺若樹収宗就衆従縦縮熟純処署諸除将傷障城蒸針仁垂推寸盛聖誠宣専泉洗染善奏窓創装層操蔵臓存尊宅担探誕段暖値宙忠著庁頂潮賃痛展討党糖届難乳認納脳派拝背肺俳班晩否批秘腹奮並陛閉片補暮宝訪亡忘棒枚幕密盟模訳郵優幼欲翌乱卵覧裏律臨朗論"
            ),
        }
    )

    def __new__(cls, _default=None):
        if _default is None:
            _default = cls.REIWA2
        instance = super().__new__(cls, _default)
        instance._default = _default
        return instance

    def grade(self, g: int) -> frozenset:
        return self._default.grade(g)

    @classmethod
    def version_list(cls):
        return [
            name
            for name, value in cls.__dict__.items()
            if isinstance(value, _KyoikuVersion)
        ]

    GRADE1 = property(partial(grade, g=1))
    GRADE2 = property(partial(grade, g=2))
    GRADE3 = property(partial(grade, g=3))
    GRADE4 = property(partial(grade, g=4))
    GRADE5 = property(partial(grade, g=5))
    GRADE6 = property(partial(grade, g=6))


KYOIKU = _Kyoiku()
JOYO = _Joyo()
